ndroid/msp432-core/src/system/source/ti/devices/msp432p4xx/inc/msp432p4111_classic.h
/******************************************************************************
*
* Adapted 2023-07-13 from msp432p401r_classic.h 
* Copyright (C) 2012 - 2018 Texas Instruments Incorporated - http://www.ti.com/
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions
* are met:
*
*  Redistributions of source code must retain the above copyright
*  notice, this list of conditions and the following disclaimer.
*
*  Redistributions in binary form must reproduce the above copyright
*  notice, this list of conditions and the following disclaimer in the
*  documentation and/or other materials provided with the
*  distribution.
*
*  Neither the name of Texas Instruments Incorporated nor the names of
*  its contributors may be used to endorse or promote products derived
*  from this software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
* "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
* LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
* OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
* SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
* DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
* THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
* MSP432P4111 Register Definitions
*
* This file includes MSP430 style component and register definitions
* for legacy components re-used in MSP432
*
* File creation date: 2018-01-26
* File modification date: 2023-07-13
*
******************************************************************************/

#ifndef __MSP432P4111_CLASSIC_H__
#define __MSP432P4111_CLASSIC_H__

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

/******************************************************************************
* Device memory map                                                           *
******************************************************************************/
#define __MAIN_MEMORY_START__                              (0x00000000)          /*!< Main Flash memory start address */
#define __MAIN_MEMORY_END__                                (0x001FFFFF)          /*!< Main Flash memory end address */
#define __BSL_MEMORY_START__                               (0x00202000)          /*!< BSL memory start address */
#define __BSL_MEMORY_END__                                 (0x00203FFF)          /*!< BSL memory end address */
#define __SRAM_START__                                     (0x20000000)          /*!< SRAM memory start address */
#define __SRAM_END__                                       (0x2003FFFF)          /*!< SRAM memory end address */

/******************************************************************************
* MSP-format peripheral registers                                             *
******************************************************************************/

/******************************************************************************
* AES256 Registers
******************************************************************************/
#define AESACTL0                                 (HWREG16(0x40003C00))           /*!< AES Accelerator Control Register 0 */
#define AESACTL1                                 (HWREG16(0x40003C02))           /*!< AES Accelerator Control Register 1 */
#define AESASTAT                                 (HWREG16(0x40003C04))           /*!< AES Accelerator Status Register */
#define AESAKEY                                  (HWREG16(0x40003C06))           /*!< AES Accelerator Key Register */
#define AESADIN                                  (HWREG16(0x40003C08))           /*!< AES Accelerator Data In Register */
#define AESADOUT                                 (HWREG16(0x40003C0A))           /*!< AES Accelerator Data Out Register */
#define AESAXDIN                                 (HWREG16(0x40003C0C))           /*!< AES Accelerator XORed Data In Register */
#define AESAXIN                                  (HWREG16(0x40003C0E))           /*!< AES Accelerator XORed Data In Register */

/* Register offsets from AES256_BASE address */
#define OFS_AESACTL0                                       (0x0000)              /*!< AES Accelerator Control Register 0 */
#define OFS_AESACTL1                                       (0x0002)              /*!< AES Accelerator Control Register 1 */
#define OFS_AESASTAT                                       (0x0004)              /*!< AES Accelerator Status Register */
#define OFS_AESAKEY                                        (0x0006)              /*!< AES Accelerator Key Register */
#define OFS_AESADIN                                        (0x0008)              /*!< AES Accelerator Data In Register */
#define OFS_AESADOUT                                       (0x000A)              /*!< AES Accelerator Data Out Register */
#define OFS_AESAXDIN                                       (0x000C)              /*!< AES Accelerator XORed Data In Register */
#define OFS_AESAXIN                                        (0x000E)              /*!< AES Accelerator XORed Data In Register */


/******************************************************************************
* CAPTIO0 Registers
******************************************************************************/
#define CAPTIO0CTL                               (HWREG16(0x4000540E))           /*!< Capacitive Touch IO x Control Register */

/* Register offsets from CAPTIO0_BASE address */
#define OFS_CAPTIO0CTL                                     (0x000E)              /*!< Capacitive Touch IO x Control Register */

#define CAPTIO0CTL_L                                       (HWREG8_L(CAPTIO0CTL))/* Capacitive Touch IO x Control Register */
#define CAPTIO0CTL_H                                       (HWREG8_H(CAPTIO0CTL))/* Capacitive Touch IO x Control Register */

