ndroid/msp432-core/src/system/source/ti/devices/msp432p4xx/inc/msp432p4111_classic.h
/******************************************************************************
* DIO Registers
******************************************************************************/
#define PAIN                                     (HWREG16(0x40004C00))           /*!< Port A Input */
#define PAOUT                                    (HWREG16(0x40004C02))           /*!< Port A Output */
#define PADIR                                    (HWREG16(0x40004C04))           /*!< Port A Direction */
#define PAREN                                    (HWREG16(0x40004C06))           /*!< Port A Resistor Enable */
#define PADS                                     (HWREG16(0x40004C08))           /*!< Port A Drive Strength */
#define PASEL0                                   (HWREG16(0x40004C0A))           /*!< Port A Select 0 */
#define PASEL1                                   (HWREG16(0x40004C0C))           /*!< Port A Select 1 */
#define P1IV                                     (HWREG16(0x40004C0E))           /*!< Port 1 Interrupt Vector Register */
#define PASELC                                   (HWREG16(0x40004C16))           /*!< Port A Complement Select */
#define PAIES                                    (HWREG16(0x40004C18))           /*!< Port A Interrupt Edge Select */
#define PAIE                                     (HWREG16(0x40004C1A))           /*!< Port A Interrupt Enable */
#define PAIFG                                    (HWREG16(0x40004C1C))           /*!< Port A Interrupt Flag */
#define P2IV                                     (HWREG16(0x40004C1E))           /*!< Port 2 Interrupt Vector Register */
#define PBIN                                     (HWREG16(0x40004C20))           /*!< Port B Input */
#define PBOUT                                    (HWREG16(0x40004C22))           /*!< Port B Output */
#define PBDIR                                    (HWREG16(0x40004C24))           /*!< Port B Direction */
#define PBREN                                    (HWREG16(0x40004C26))           /*!< Port B Resistor Enable */
#define PBDS                                     (HWREG16(0x40004C28))           /*!< Port B Drive Strength */
#define PBSEL0                                   (HWREG16(0x40004C2A))           /*!< Port B Select 0 */
#define PBSEL1                                   (HWREG16(0x40004C2C))           /*!< Port B Select 1 */
#define P3IV                                     (HWREG16(0x40004C2E))           /*!< Port 3 Interrupt Vector Register */
#define PBSELC                                   (HWREG16(0x40004C36))           /*!< Port B Complement Select */
#define PBIES                                    (HWREG16(0x40004C38))           /*!< Port B Interrupt Edge Select */
#define PBIE                                     (HWREG16(0x40004C3A))           /*!< Port B Interrupt Enable */
#define PBIFG                                    (HWREG16(0x40004C3C))           /*!< Port B Interrupt Flag */
#define P4IV                                     (HWREG16(0x40004C3E))           /*!< Port 4 Interrupt Vector Register */
#define PCIN                                     (HWREG16(0x40004C40))           /*!< Port C Input */
#define PCOUT                                    (HWREG16(0x40004C42))           /*!< Port C Output */
#define PCDIR                                    (HWREG16(0x40004C44))           /*!< Port C Direction */
#define PCREN                                    (HWREG16(0x40004C46))           /*!< Port C Resistor Enable */
#define PCDS                                     (HWREG16(0x40004C48))           /*!< Port C Drive Strength */
#define PCSEL0                                   (HWREG16(0x40004C4A))           /*!< Port C Select 0 */
#define PCSEL1                                   (HWREG16(0x40004C4C))           /*!< Port C Select 1 */
#define P5IV                                     (HWREG16(0x40004C4E))           /*!< Port 5 Interrupt Vector Register */
#define PCSELC                                   (HWREG16(0x40004C56))           /*!< Port C Complement Select */
#define PCIES                                    (HWREG16(0x40004C58))           /*!< Port C Interrupt Edge Select */
#define PCIE                                     (HWREG16(0x40004C5A))           /*!< Port C Interrupt Enable */
#define PCIFG                                    (HWREG16(0x40004C5C))           /*!< Port C Interrupt Flag */
#define P6IV                                     (HWREG16(0x40004C5E))           /*!< Port 6 Interrupt Vector Register */
#define PDIN                                     (HWREG16(0x40004C60))           /*!< Port D Input */
#define PDOUT                                    (HWREG16(0x40004C62))           /*!< Port D Output */
#define PDDIR                                    (HWREG16(0x40004C64))           /*!< Port D Direction */
#define PDREN                                    (HWREG16(0x40004C66))           /*!< Port D Resistor Enable */
#define PDDS                                     (HWREG16(0x40004C68))           /*!< Port D Drive Strength */
#define PDSEL0                                   (HWREG16(0x40004C6A))           /*!< Port D Select 0 */
#define PDSEL1                                   (HWREG16(0x40004C6C))           /*!< Port D Select 1 */
#define P7IV                                     (HWREG16(0x40004C6E))           /*!< Port 7 Interrupt Vector Register */
#define PDSELC                                   (HWREG16(0x40004C76))           /*!< Port D Complement Select */
#define PDIES                                    (HWREG16(0x40004C78))           /*!< Port D Interrupt Edge Select */
#define PDIE                                     (HWREG16(0x40004C7A))           /*!< Port D Interrupt Enable */
#define PDIFG                                    (HWREG16(0x40004C7C))           /*!< Port D Interrupt Flag */
#define P8IV                                     (HWREG16(0x40004C7E))           /*!< Port 8 Interrupt Vector Register */
#define PEIN                                     (HWREG16(0x40004C80))           /*!< Port E Input */
#define PEOUT                                    (HWREG16(0x40004C82))           /*!< Port E Output */
#define PEDIR                                    (HWREG16(0x40004C84))           /*!< Port E Direction */
#define PEREN                                    (HWREG16(0x40004C86))           /*!< Port E Resistor Enable */
#define PEDS                                     (HWREG16(0x40004C88))           /*!< Port E Drive Strength */
#define PESEL0                                   (HWREG16(0x40004C8A))           /*!< Port E Select 0 */
#define PESEL1                                   (HWREG16(0x40004C8C))           /*!< Port E Select 1 */
#define P9IV                                     (HWREG16(0x40004C8E))           /*!< Port 9 Interrupt Vector Register */
#define PESELC                                   (HWREG16(0x40004C96))           /*!< Port E Complement Select */
#define PEIES                                    (HWREG16(0x40004C98))           /*!< Port E Interrupt Edge Select */
#define PEIE                                     (HWREG16(0x40004C9A))           /*!< Port E Interrupt Enable */
#define PEIFG                                    (HWREG16(0x40004C9C))           /*!< Port E Interrupt Flag */
#define P10IV                                    (HWREG16(0x40004C9E))           /*!< Port 10 Interrupt Vector Register */
#define PJIN                                     (HWREG16(0x40004D20))           /*!< Port J Input */
#define PJOUT                                    (HWREG16(0x40004D22))           /*!< Port J Output */
#define PJDIR                                    (HWREG16(0x40004D24))           /*!< Port J Direction */
#define PJREN                                    (HWREG16(0x40004D26))           /*!< Port J Resistor Enable */
#define PJDS                                     (HWREG16(0x40004D28))           /*!< Port J Drive Strength */
#define PJSEL0                                   (HWREG16(0x40004D2A))           /*!< Port J Select 0 */
#define PJSEL1                                   (HWREG16(0x40004D2C))           /*!< Port J Select 1 */
#define PJSELC                                   (HWREG16(0x40004D36))           /*!< Port J Complement Select */
#define P1IN                                     (HWREG8(0x40004C00))            /*!< Port 1 Input */
#define P2IN                                     (HWREG8(0x40004C01))            /*!< Port 2 Input */
#define P2OUT                                    (HWREG8(0x40004C03))            /*!< Port 2 Output */
#define P1OUT                                    (HWREG8(0x40004C02))            /*!< Port 1 Output */
#define P1DIR                                    (HWREG8(0x40004C04))            /*!< Port 1 Direction */
#define P2DIR                                    (HWREG8(0x40004C05))            /*!< Port 2 Direction */
#define P1REN                                    (HWREG8(0x40004C06))            /*!< Port 1 Resistor Enable */
#define P2REN                                    (HWREG8(0x40004C07))            /*!< Port 2 Resistor Enable */
#define P1DS                                     (HWREG8(0x40004C08))            /*!< Port 1 Drive Strength */
#define P2DS                                     (HWREG8(0x40004C09))            /*!< Port 2 Drive Strength */
#define P1SEL0                                   (HWREG8(0x40004C0A))            /*!< Port 1 Select 0 */
#define P2SEL0                                   (HWREG8(0x40004C0B))            /*!< Port 2 Select 0 */
#define P1SEL1                                   (HWREG8(0x40004C0C))            /*!< Port 1 Select 1 */
#define P2SEL1                                   (HWREG8(0x40004C0D))            /*!< Port 2 Select 1 */
#define P1SELC                                   (HWREG8(0x40004C16))            /*!< Port 1 Complement Select */
#define P2SELC                                   (HWREG8(0x40004C17))            /*!< Port 2 Complement Select */
#define P1IES                                    (HWREG8(0x40004C18))            /*!< Port 1 Interrupt Edge Select */
#define P2IES                                    (HWREG8(0x40004C19))            /*!< Port 2 Interrupt Edge Select */
#define P1IE                                     (HWREG8(0x40004C1A))            /*!< Port 1 Interrupt Enable */
#define P2IE                                     (HWREG8(0x40004C1B))            /*!< Port 2 Interrupt Enable */
#define P1IFG                                    (HWREG8(0x40004C1C))            /*!< Port 1 Interrupt Flag */
#define P2IFG                                    (HWREG8(0x40004C1D))            /*!< Port 2 Interrupt Flag */
#define P3IN                                     (HWREG8(0x40004C20))            /*!< Port 3 Input */
#define P4IN                                     (HWREG8(0x40004C21))            /*!< Port 4 Input */
#define P3OUT                                    (HWREG8(0x40004C22))            /*!< Port 3 Output */
#define P4OUT                                    (HWREG8(0x40004C23))            /*!< Port 4 Output */
#define P3DIR                                    (HWREG8(0x40004C24))            /*!< Port 3 Direction */
#define P4DIR                                    (HWREG8(0x40004C25))            /*!< Port 4 Direction */
#define P3REN                                    (HWREG8(0x40004C26))            /*!< Port 3 Resistor Enable */
#define P4REN                                    (HWREG8(0x40004C27))            /*!< Port 4 Resistor Enable */
#define P3DS                                     (HWREG8(0x40004C28))            /*!< Port 3 Drive Strength */
#define P4DS                                     (HWREG8(0x40004C29))            /*!< Port 4 Drive Strength */
#define P4SEL0                                   (HWREG8(0x40004C2B))            /*!< Port 4 Select 0 */
#define P3SEL0                                   (HWREG8(0x40004C2A))            /*!< Port 3 Select 0 */
#define P3SEL1                                   (HWREG8(0x40004C2C))            /*!< Port 3 Select 1 */
#define P4SEL1                                   (HWREG8(0x40004C2D))            /*!< Port 4 Select 1 */
#define P3SELC                                   (HWREG8(0x40004C36))            /*!< Port 3 Complement Select */
#define P4SELC                                   (HWREG8(0x40004C37))            /*!< Port 4 Complement Select */
#define P3IES                                    (HWREG8(0x40004C38))            /*!< Port 3 Interrupt Edge Select */
#define P4IES                                    (HWREG8(0x40004C39))            /*!< Port 4 Interrupt Edge Select */
#define P3IE                                     (HWREG8(0x40004C3A))            /*!< Port 3 Interrupt Enable */
#define P4IE                                     (HWREG8(0x40004C3B))            /*!< Port 4 Interrupt Enable */
#define P3IFG                                    (HWREG8(0x40004C3C))            /*!< Port 3 Interrupt Flag */
#define P4IFG                                    (HWREG8(0x40004C3D))            /*!< Port 4 Interrupt Flag */
#define P5IN                                     (HWREG8(0x40004C40))            /*!< Port 5 Input */
#define P6IN                                     (HWREG8(0x40004C41))            /*!< Port 6 Input */
#define P5OUT                                    (HWREG8(0x40004C42))            /*!< Port 5 Output */
#define P6OUT                                    (HWREG8(0x40004C43))            /*!< Port 6 Output */
#define P5DIR                                    (HWREG8(0x40004C44))            /*!< Port 5 Direction */
#define P6DIR                                    (HWREG8(0x40004C45))            /*!< Port 6 Direction */
#define P5REN                                    (HWREG8(0x40004C46))            /*!< Port 5 Resistor Enable */
#define P6REN                                    (HWREG8(0x40004C47))            /*!< Port 6 Resistor Enable */
#define P5DS                                     (HWREG8(0x40004C48))            /*!< Port 5 Drive Strength */
#define P6DS                                     (HWREG8(0x40004C49))            /*!< Port 6 Drive Strength */
#define P5SEL0                                   (HWREG8(0x40004C4A))            /*!< Port 5 Select 0 */
#define P6SEL0                                   (HWREG8(0x40004C4B))            /*!< Port 6 Select 0 */
#define P5SEL1                                   (HWREG8(0x40004C4C))            /*!< Port 5 Select 1 */
#define P6SEL1                                   (HWREG8(0x40004C4D))            /*!< Port 6 Select 1 */
#define P5SELC                                   (HWREG8(0x40004C56))            /*!< Port 5 Complement Select */
#define P6SELC                                   (HWREG8(0x40004C57))            /*!< Port 6 Complement Select */
#define P5IES                                    (HWREG8(0x40004C58))            /*!< Port 5 Interrupt Edge Select */
#define P6IES                                    (HWREG8(0x40004C59))            /*!< Port 6 Interrupt Edge Select */
#define P5IE                                     (HWREG8(0x40004C5A))            /*!< Port 5 Interrupt Enable */
#define P6IE                                     (HWREG8(0x40004C5B))            /*!< Port 6 Interrupt Enable */
#define P5IFG                                    (HWREG8(0x40004C5C))            /*!< Port 5 Interrupt Flag */
#define P6IFG                                    (HWREG8(0x40004C5D))            /*!< Port 6 Interrupt Flag */
#define P7IN                                     (HWREG8(0x40004C60))            /*!< Port 7 Input */
#define P8IN                                     (HWREG8(0x40004C61))            /*!< Port 8 Input */
#define P7OUT                                    (HWREG8(0x40004C62))            /*!< Port 7 Output */
#define P8OUT                                    (HWREG8(0x40004C63))            /*!< Port 8 Output */
#define P7DIR                                    (HWREG8(0x40004C64))            /*!< Port 7 Direction */
#define P8DIR                                    (HWREG8(0x40004C65))            /*!< Port 8 Direction */
#define P7REN                                    (HWREG8(0x40004C66))            /*!< Port 7 Resistor Enable */
#define P8REN                                    (HWREG8(0x40004C67))            /*!< Port 8 Resistor Enable */
#define P7DS                                     (HWREG8(0x40004C68))            /*!< Port 7 Drive Strength */
#define P8DS                                     (HWREG8(0x40004C69))            /*!< Port 8 Drive Strength */
#define P7SEL0                                   (HWREG8(0x40004C6A))            /*!< Port 7 Select 0 */
#define P8SEL0                                   (HWREG8(0x40004C6B))            /*!< Port 8 Select 0 */
#define P7SEL1                                   (HWREG8(0x40004C6C))            /*!< Port 7 Select 1 */
#define P8SEL1                                   (HWREG8(0x40004C6D))            /*!< Port 8 Select 1 */
#define P7SELC                                   (HWREG8(0x40004C76))            /*!< Port 7 Complement Select */
#define P8SELC                                   (HWREG8(0x40004C77))            /*!< Port 8 Complement Select */
#define P7IES                                    (HWREG8(0x40004C78))            /*!< Port 7 Interrupt Edge Select */
#define P8IES                                    (HWREG8(0x40004C79))            /*!< Port 8 Interrupt Edge Select */
#define P7IE                                     (HWREG8(0x40004C7A))            /*!< Port 7 Interrupt Enable */
#define P8IE                                     (HWREG8(0x40004C7B))            /*!< Port 8 Interrupt Enable */
#define P7IFG                                    (HWREG8(0x40004C7C))            /*!< Port 7 Interrupt Flag */
#define P8IFG                                    (HWREG8(0x40004C7D))            /*!< Port 8 Interrupt Flag */
#define P9IN                                     (HWREG8(0x40004C80))            /*!< Port 9 Input */
#define P10IN                                    (HWREG8(0x40004C81))            /*!< Port 10 Input */
#define P9OUT                                    (HWREG8(0x40004C82))            /*!< Port 9 Output */
#define P10OUT                                   (HWREG8(0x40004C83))            /*!< Port 10 Output */
#define P9DIR                                    (HWREG8(0x40004C84))            /*!< Port 9 Direction */
#define P10DIR                                   (HWREG8(0x40004C85))            /*!< Port 10 Direction */
#define P9REN                                    (HWREG8(0x40004C86))            /*!< Port 9 Resistor Enable */
#define P10REN                                   (HWREG8(0x40004C87))            /*!< Port 10 Resistor Enable */
#define P9DS                                     (HWREG8(0x40004C88))            /*!< Port 9 Drive Strength */
#define P10DS                                    (HWREG8(0x40004C89))            /*!< Port 10 Drive Strength */
#define P9SEL0                                   (HWREG8(0x40004C8A))            /*!< Port 9 Select 0 */
#define P10SEL0                                  (HWREG8(0x40004C8B))            /*!< Port 10 Select 0 */
#define P9SEL1                                   (HWREG8(0x40004C8C))            /*!< Port 9 Select 1 */
#define P10SEL1                                  (HWREG8(0x40004C8D))            /*!< Port 10 Select 1 */
#define P9SELC                                   (HWREG8(0x40004C96))            /*!< Port 9 Complement Select */
#define P10SELC                                  (HWREG8(0x40004C97))            /*!< Port 10 Complement Select */
#define P9IES                                    (HWREG8(0x40004C98))            /*!< Port 9 Interrupt Edge Select */
#define P10IES                                   (HWREG8(0x40004C99))            /*!< Port 10 Interrupt Edge Select */
#define P9IE                                     (HWREG8(0x40004C9A))            /*!< Port 9 Interrupt Enable */
#define P10IE                                    (HWREG8(0x40004C9B))            /*!< Port 10 Interrupt Enable */
#define P9IFG                                    (HWREG8(0x40004C9C))            /*!< Port 9 Interrupt Flag */
#define P10IFG                                   (HWREG8(0x40004C9D))            /*!< Port 10 Interrupt Flag */

